# ####################################################################

#  Created by Encounter(R) RTL Compiler v07.20-s009_1 on Mon Aug 31 11:31:48 BRT 2009

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design t6507lp_io

create_clock -name "1MHz" -add -period 1000.0 -waveform {0.0 500.0} [get_ports clk]
set_clock_transition -max 0.1 [get_clocks 1MHz]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[0]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[1]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[2]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[3]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[4]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[5]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[6]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[7]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[8]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[9]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[10]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[11]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {address[12]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[0]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[1]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[2]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[3]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[4]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[5]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[6]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_out[7]}]
set_output_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports rw_mem]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[0]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[1]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[2]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[3]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[4]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[5]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[6]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports {data_in[7]}]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports scan_enable]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports reset_n]
set_input_delay -clock [get_clocks 1MHz] -add_delay 0.1 [get_ports clk]
set_max_dynamic_power 3000000.0
set_ideal_network [get_ports reset_n]
set_ideal_network [get_ports scan_enable]
set_ideal_network [get_pins reset_n_pad/Y]
set_ideal_network [get_pins scan_pad/Y]
set_wire_load_selection_group "2_metls_routing" -library "D_CELLSL_3_3V"
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELL10L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELL25L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELL2L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELL50L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELL5L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELLN10L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELLN25L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELLN2L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELLN50L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/ANTENNACELLN5L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/BUCLX16]
set_dont_use [get_lib_cells D_CELLSL_3_3V/BULX16]
set_dont_use [get_lib_cells D_CELLSL_3_3V/EN2LX1]
set_dont_use [get_lib_cells D_CELLSL_3_3V/INCLX16]
set_dont_use [get_lib_cells D_CELLSL_3_3V/INLX16]
set_dont_use [get_lib_cells D_CELLSL_3_3V/SIGNALHOLDL]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEED1L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEED2L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEED5L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEED10L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEED25L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEED50L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEEDCAP2L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEEDCAP5L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEEDCAP10L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEEDCAP25L]
set_dont_use [get_lib_cells D_CELLSL_3_3V/FEEDCAP50L]
set_dont_use [get_lib_cells IO_CELLS_33/BBC16P]
set_dont_use [get_lib_cells IO_CELLS_33/BBC16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC1P]
set_dont_use [get_lib_cells IO_CELLS_33/BBC1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC20P]
set_dont_use [get_lib_cells IO_CELLS_33/BBC20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC2P]
set_dont_use [get_lib_cells IO_CELLS_33/BBC2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC4P]
set_dont_use [get_lib_cells IO_CELLS_33/BBC4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC8P]
set_dont_use [get_lib_cells IO_CELLS_33/BBC8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBC8SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA16P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA1P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA20P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA2P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA4P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA8P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCA8SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD16P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD1P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD20P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD2P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD4P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD8P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCHD8SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD16P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD1P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD20P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD2P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD4P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD8P]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBCUD8SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBL1P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL1SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL2P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL2SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL4P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL4SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL8P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL8SMP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBL8SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD1P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD1SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD2P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD2SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD4P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD4SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD8P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD8SMP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLHD8SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD1P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD1SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD2P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD2SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD4P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD4SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD8P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD8SMP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBLUD8SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS1P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS1SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS2P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS2SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS4P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS4SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS8P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS8SMP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBS8SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD1P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD1SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD2P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD2SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD4P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD4SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD8P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD8SMP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSHD8SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD1P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD1SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD2P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD2SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD4P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD4SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD8P_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD8SMP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBSUD8SP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/BBT16P]
set_dont_use [get_lib_cells IO_CELLS_33/BBT16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT1P]
set_dont_use [get_lib_cells IO_CELLS_33/BBT1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT20P]
set_dont_use [get_lib_cells IO_CELLS_33/BBT20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT2P]
set_dont_use [get_lib_cells IO_CELLS_33/BBT2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT4P]
set_dont_use [get_lib_cells IO_CELLS_33/BBT4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT8P]
set_dont_use [get_lib_cells IO_CELLS_33/BBT8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBT8SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD16P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD1P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD20P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD2P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD4P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD8P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTHD8SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD16P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD1P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD20P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD2P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD4P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD8P]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BBTUD8SP]
set_dont_use [get_lib_cells IO_CELLS_33/BT16P]
set_dont_use [get_lib_cells IO_CELLS_33/BT16SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BT16SP]
set_dont_use [get_lib_cells IO_CELLS_33/BT1P]
set_dont_use [get_lib_cells IO_CELLS_33/BT1SP]
set_dont_use [get_lib_cells IO_CELLS_33/BT20P]
set_dont_use [get_lib_cells IO_CELLS_33/BT20SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BT20SP]
set_dont_use [get_lib_cells IO_CELLS_33/BT2P]
set_dont_use [get_lib_cells IO_CELLS_33/BT2SP]
set_dont_use [get_lib_cells IO_CELLS_33/BT4P]
set_dont_use [get_lib_cells IO_CELLS_33/BT4SP]
set_dont_use [get_lib_cells IO_CELLS_33/BT8P]
set_dont_use [get_lib_cells IO_CELLS_33/BT8SMP]
set_dont_use [get_lib_cells IO_CELLS_33/BT8SP]
set_dont_use [get_lib_cells IO_CELLS_33/ICAP]
set_dont_use [get_lib_cells IO_CELLS_33/ICHDP]
set_dont_use [get_lib_cells IO_CELLS_33/ICP]
set_dont_use [get_lib_cells IO_CELLS_33/ICUDP]
set_dont_use [get_lib_cells IO_CELLS_33/ILHDP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/ILP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/ILUDP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/ISHDP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/ISP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/ISUDP_3V]
set_dont_use [get_lib_cells IO_CELLS_33/ITHDP]
set_dont_use [get_lib_cells IO_CELLS_33/ITP]
set_dont_use [get_lib_cells IO_CELLS_33/ITUDP]
set_dont_use [get_lib_cells IO_CELLS_33/APR00P]
set_dont_use [get_lib_cells IO_CELLS_33/APR01P]
set_dont_use [get_lib_cells IO_CELLS_33/APR04P]
set_dont_use [get_lib_cells IO_CELLS_33/APR15P]
set_dont_use [get_lib_cells IO_CELLS_33/CLAMP]
set_dont_use [get_lib_cells IO_CELLS_33/CORNERCLMP]
set_dont_use [get_lib_cells IO_CELLS_33/CORNERP]
set_dont_use [get_lib_cells IO_CELLS_33/FILLCLMP_30]
set_dont_use [get_lib_cells IO_CELLS_33/FILLCLMP_40]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_1]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_2]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_3]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_4]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_5]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_10]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_11]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_20]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_30]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_40]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_50]
set_dont_use [get_lib_cells IO_CELLS_33/FILLERP_110]
set_dont_use [get_lib_cells IO_CELLS_33/PWRC_ORP]
set_dont_use [get_lib_cells IO_CELLS_33/GND5ALLPADP]
set_dont_use [get_lib_cells IO_CELLS_33/GND5IPADP]
set_dont_use [get_lib_cells IO_CELLS_33/GND5OPADP]
set_dont_use [get_lib_cells IO_CELLS_33/GND5RPADP]
set_dont_use [get_lib_cells IO_CELLS_33/VDD5ALLPADP]
set_dont_use [get_lib_cells IO_CELLS_33/VDD5IPADP]
set_dont_use [get_lib_cells IO_CELLS_33/VDD5OPADP]
set_dont_use [get_lib_cells IO_CELLS_33/VDD5RPADP]
## List of unsupported SDC commands ##
